In [4]:
# !pip install cx_oracle
# 설치완료

In [1]:
import cx_Oracle
import pandas as pd
# .connect(id, 비번, "호스트이름:포트/SID")
# 데이터베이스 속성에서 확인 가능
# SID : 서비스이름
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from BOOK") # execute("쿼리문") : 실행
# 패치시켜주어야함
x = cursor.fetchall()
df = pd.DataFrame(x) # 데이터만 넣어주니깐 컬럼 정보가 없음
df

    0                  1        2      3
0   1             축구의 역사     굿스포츠   7000
1   2            축구아는 여자      나무수  13000
2   3             축구의 이해    대한미디어  22000
3   4             골프 바이블    대한미디어  35000
4   5              피겨 교본     굿스포츠   8000
5   6           역도 단계별기술     굿스포츠   6000
6   7             야구의 추억    이상미디어  20000
7   8            야구를 부탁해    이상미디어  13000
8   9            올림픽 이야기      삼성당   7500
9  10  Olympic Champions  Pearson  13000

In [2]:
# 연결
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from BOOK") # execute("쿼리문") : 실행
# 패치시켜주어야함
x = cursor.fetchall()
df = pd.DataFrame(x)
# 컬럼 가져오기. 여기서 where이하 table_name은 원래 형식에 맞게 넣어주여야함(대문자면 대문자)
cursor.execute("""select column_name from user_tab_columns where table_name = 'BOOK'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

   BOOKID BOOKNAME PUBLISHER  PRICE
0       1   축구의 역사      굿스포츠   7000
1       2  축구아는 여자       나무수  13000
2       3   축구의 이해     대한미디어  22000
3       4   골프 바이블     대한미디어  35000
4       5    피겨 교본      굿스포츠   8000

In [3]:
# 위에 for문 풀어쓰면?
col_new = []

for i in col :
    for j in i :
        col_new.append(j)
col_new

['BOOKID', 'BOOKNAME', 'PUBLISHER', 'PRICE']

In [4]:
# 순서대로 닫아주어야함
cursor.close()
db.close()

In [5]:
Q. hr 사용자를 적용하여 원하는 테이블을 가져와서 df로 출력하세요(컬럼명 포함)

SyntaxError: invalid syntax (492257428.py, line 1)

In [ ]:
import cx_Oracle
import pandas as pd
# 연결
db = cx_Oracle.connect("c##hr", "hr", "localhost:1521/xe")
cursor = db.cursor()
# 테이블 가져오기
cursor.execute("select * from employees")
# 패치
x = cursor.fetchall()
df = pd.DataFrame(x)
# 컬럼 가져오기. 여기서 where이하 table_name은 원래 형식에 맞게 넣어주여야함(대문자면 대문자)
cursor.execute("""select column_name from user_tab_columns where table_name = 'EMPLOYEES'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df

In [ ]:
# 마지막에 닫아주어야함
cursor.close()
db.close()

In [7]:
# create
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cs = db.cursor()
sql = "create table sample1(id varchar2(10), score number)"
cs.execute(sql)
cs.close()
db.commit()
db.close()

In [ ]:
# insert
def insert(t):
    db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
    cs = db.cursor()
    sql = "insert into sample1 (id, score) values (:1,:2)"
    cs.execute(sql,t)
    cs.close()
    db.commit()
    db.close()
    
insert(('9','1')) # db에 sample1 테이블이 생성되고 id에 값이 9, score에 값이 1 들어가 있는것을 확인할수있음

In [ ]:
import cx_Oracle
db = cx_Oracle.connect("c##madang","madang","localhost:1521/xe")
cursor = db.cursor()
cursor.execute("create table sample2(id number)")
cursor.execute("insert into sample2(id) values(1)")
db.commit()
db.close()

In [13]:
# 고객DEMO
# 연결
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
# 테이블 가져오기
cursor.execute("select * from demo")
# 패치
x = cursor.fetchall()
df = pd.DataFrame(x)
# 컬럼 가져오기. 여기서 where이하 table_name은 원래 형식에 맞게 넣어주여야함(대문자면 대문자)
cursor.execute("""select column_name from user_tab_columns where table_name = 'DEMO'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df

      CUSTNO GENDER      AGE AREA
0      00501      F    60세이상  460
1      00502      F    60세이상  060
2      00503      F    60세이상  055
3      00504      F    60세이상  049
4      00505      F    60세이상  055
...      ...    ...      ...  ...
19378  19261      F    60세이상  072
19379  19262      F  20세~24세  052
19380  19263      F    60세이상  460
19381  19264      F  45세~49세  100
19382  19265      M    60세이상  410

[19383 rows x 4 columns]

In [14]:
df.shape

(19383, 4)

In [15]:
df.AGE.value_counts()

45세~49세    4082
40세~44세    3677
50세~54세    3114
35세~39세    2769
55세~59세    1774
30세~34세    1679
60세이상      1303
25세~29세     685
20세~24세     283
19세이하        17
Name: AGE, dtype: int64

In [16]:
df.AGE.unique()

array(['60세이상', '55세~59세', '50세~54세', '45세~49세', '40세~44세', '35세~39세',
       '30세~34세', '25세~29세', '20세~24세', '19세이하'], dtype=object)

In [18]:
# PRODCL. 상품분류
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from PRODCL")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'PRODCL'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

  ASSO  BCODE MCODE    SCODE    MCL      SCL
0    A      4  0409  A040902   디자이너   디자이너부틱
1    A      4  0409  A040903   디자이너  디자이너캐릭터
2    A      4  0410  A041001  모피/피혁       모피
3    A      4  0410  A041002  모피/피혁       피혁
4    A      4  0410  A041003  모피/피혁   숙녀고정행사

In [19]:
df.ASSO.value_counts()

B    2624
C     987
A     630
D     145
Name: ASSO, dtype: int64

In [20]:
df.BCODE.unique()

array([ 4,  5,  6,  7,  8,  9,  1,  2,  3, 28, 29, 30, 31, 32, 33, 34, 10,
       11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71, 72, 73, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46,
       47, 48, 49, 50, 51, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85,
       86, 87, 88, 89, 90, 91, 92], dtype=int64)

- 과제 10/12 (1)<br>- PURPRD 테이블을 가져와서 다음사항을 수행하세요.
 - pivot_table을 이용해서 고객번호별 대분류별 구매금액을 도출
 - 고객별 구매관련 의미있는 인사이트를 뽑아낼 수 있는 데이터 셋을 출력(2개 이상)

In [ ]:
# PURPRD. 구매상품TR
# 연결
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
# 테이블 가져오기
cursor.execute("select * from purprd")
# 패치
x = cursor.fetchall()
df = pd.DataFrame(x)
# 컬럼 가져오기. 여기서 where이하 table_name은 원래 형식에 맞게 넣어주여야함(대문자면 대문자)
cursor.execute("""select column_name from user_tab_columns where table_name = 'PURPRD'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df
### 이거 한시간걸림 ###